2sayle/NFC-with-STM32L476/Core/Src/st25r3911b_hal_driver.c
/**
 * @file st25r3911b_hal_driver.c
 * @brief This file contains the HAL driver implementation for the ST25R3911B NFC controller.
 *
 * This file provides the necessary functions to initialize and control the ST25R3911B NFC controller
 * using the HAL (Hardware Abstraction Layer) library provided by STMicroelectronics.
 *
 * @date Jun 2, 2024
 * @author Elyass Jaoudat
 */

/* Includes ------------------------------------------------- */
#include <string.h>
#include "stm32l476xx.h"
#include "main.h"
#include "macros.h"
#include "iso14443.h"
#include "st25r3911b_hal_driver.h"
#include "st25r3911b_errors.h"


/* Exported variables --------------------------------------- */

/* Hardware */
byte IC_Version = 0;

/* SPI */
extern SPI_HandleTypeDef hspi1;

/* IRQ Handler */
extern byte ST25R_IRQ_FLAG;
extern irq_reason_t ST25R_IRQ_REASON;

/* FIFO */
byte fifo_lb = 0;
byte fifo_ncp = 0;
byte fifo_np_lb = 0;
byte rxBuffer[MAX_NUMBER_RX_BYTES] = {0};
byte txBuffer[MAX_NUMBER_TX_BYTES] = {0};

/* ISO14443 */
pcd_state ST25R_PCD_STATE = PCD_STANDBY;

/* Private functions prototypes ----------------------------- */

static byte WaitForSpecificIRQ(irq_reason_t);
static byte WaitForSpecificIRQ_T(irq_reason_t, word);
static byte WaitForDirectCommand(void);
static byte CheckForSpecificIRQ(irq_reason_t);


/* Static functions ----------------------------------------- */

static byte WaitForSpecificIRQ(irq_reason_t irqReason) {
    /* Wait for the IRQ to happen */
    while (ST25R_IRQ_FLAG == 0);

    /* Check if correct IRQ reason has been set */
    if (ST25R_IRQ_REASON != irqReason) {
        return ST25R_IRQ_ERROR;
    }
    /* Clear the IRQ flag */
    ST25R_IRQ_FLAG = 0;

    return ST25R_OK;
}

static byte WaitForSpecificIRQ_T(irq_reason_t irqReason, word timeout) {
    /* Get the current tick value */
    word startTick = HAL_GetTick();

    /* Wait for the IRQ to happen */
    while (1) {
        /* Check if the timeout has elapsed */
        if ((HAL_GetTick() - startTick) > timeout) {
            return ST25R_TIMEOUT_ERROR;
        }

        if (ST25R_IRQ_FLAG == 1) {
            if (ST25R_IRQ_REASON == irqReason) {
                /* Clear the IRQ flag */
                ST25R_IRQ_FLAG = 0;
                return ST25R_OK;
            }
            /* Clear the IRQ flag */
            ST25R_IRQ_FLAG = 0;
        }
    }

    return ST25R_IRQ_ERROR;
}

static byte WaitForDirectCommand(void) {
    /* Wait for the IRQ to happen */
    while (ST25R_IRQ_FLAG == 0);

    /* Check if correct IRQ reason has been set */
    if (ST25R_IRQ_REASON != ST25R_DIRECT_CMD_STOP_IRQ) {
        return ST25R_IRQ_ERROR;
    }
    /* Clear the IRQ flag */
    ST25R_IRQ_FLAG = 0;

    return ST25R_OK;
}

static byte CheckForSpecificIRQ(irq_reason_t irqReason) {
    if (ST25R_IRQ_FLAG == 1) {
        if (ST25R_IRQ_REASON == irqReason) {
            return ST25R_OK;
        }

        /* Clear the IRQ flag */
        ST25R_IRQ_FLAG = 0;
    }

    return ST25R_IRQ_ERROR;
}


/* Functions ------------------------------------------------ */


/**
 * @brief Write a register of the ST25R3911B
 * 
 * @param addr Address of the register to be written
 * @param regData Data to be written in the register
 * @return byte ST25R_OK if the register has been written successfully
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 */
/* Basic functions */
byte ST25R_WriteRegister(byte addr, byte regData) {

    /* Assert parameters */
    if (addr > MAX_ADDR_NUMBER) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Add appropriate mask (not used in write reg mode) */
    addr |= ST25R_REG_WRITE;

    /* Send address */
    SPI1_RESET_NSS();
    if (HAL_SPI_Transmit(&hspi1, &addr, 1, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    
    /* Send data to modify associated register */
    if (HAL_SPI_Transmit(&hspi1, &regData, 1, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    SPI1_SET_NSS();

    return ST25R_OK;

}


/**
 * @brief Read a register of the ST25R3911B
 * 
 * @param addr Address of the register to be read
 * @param regData Pointer to the register data
 * @return byte ST25R_OK if the register has been read successfully
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 */

byte ST25R_ReadRegister(byte addr, byte *regData) {
    /* Assert parameters */
    if (addr > MAX_ADDR_NUMBER) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Add appropriate mask */
    addr |= ST25R_REG_READ;
    
    /* Send address */
    SPI1_RESET_NSS();
    if (HAL_SPI_Transmit(&hspi1, &addr, 1, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Receive register data */
    if (HAL_SPI_Receive(&hspi1, regData, 1, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    SPI1_SET_NSS();
    return ST25R_OK;

}

/**
 * @brief Write multiple registers of the ST25R3911B
 * 
 * @param startAddr Start address of the registers to be written
 * @param regDataArray Pointer to the data buffer
 * @param len Length of the data buffer
 * @return byte ST25R_OK if the registers have been written successfully
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 */
byte ST25R_WriteMultipleRegisters(byte startAddr, byte *regDataArray, byte len) {

    /* Assert parameters */
    if ((startAddr > MAX_ADDR_NUMBER) || (regDataArray == NULL) || (len == 0)) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Prepare buffer */
    byte txBuf[MAX_ADDR_NUMBER + 1] = {0};
    txBuf[0] = startAddr | ST25R_REG_WRITE;
    memcpy(&txBuf[1], regDataArray, (size_t)len);

