2sayle/NFC-with-STM32L476/Core/Src/st25r3911b_hal_driver.c
    /* Store the IC version */
    IC_Version = regData & 0x07;

    return ST25R_OK;

}


/**
 * @brief Initialize the ST25R3911B module. It corresponds to the power-up sequence.
 * See section 1.2.16 of the ST25R3911B datasheet.
 * 
 * @return byte ST25R_OK if the module has been initialized successfully
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_IRQ_ERROR if an error occurs during IRQ handling
 * @return byte ST25R_PWR_SUPPLY_ERROR if an error occurs during power supply measurement
 * @return byte ST25R_UNKNOWN_ERROR if an unknown error occurs
 */
byte ST25R_PowerUpSequence(void) {

    /* Local variables */
    byte regData = 0;

    /* Power-Up Sequence (see section 1.2.16 of DS11793) */

    /* Send "Set Default" direct command */
    if (ST25R_SendDirectCommand(ST25R_SET_DEFAULT_CMD) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Configure the two IO configuration registers */
    regData = 0x3F;
    if (ST25R_WriteRegister(ST25R_IO_CONF1_REG, regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    regData = 0x18;
    if (ST25R_WriteRegister(ST25R_IO_CONF2_REG, 0x00) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Set en bit in Operation control register (otherwise, regulator is OFF) */
    if (ST25R_SetBitInRegister(ST25R_OP_CONTROL_REG, 7) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Configure regulator register */
    if (ST25R_WriteRegister(ST25R_REGUL_VOLTAGE_CTRL_REG, 0x00) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Send command to adjust the regulator */
    if (ST25R_SendDirectCommand(ST25R_ADJUST_REGULATORS_CMD) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    if (WaitForDirectCommand() != ST25R_OK) {
        return ST25R_IRQ_ERROR;
    }

    /* Measure and power supply */
    ushort voltage;
    if (ST25R_MeasurePowerSupply(&voltage, ST25R_MEAS_SRC_VDD) != ST25R_OK) {
        return ST25R_PWR_SUPPLY_ERROR;
    }
    if ((voltage < 2400) || (voltage > 5500)) {
        return ST25R_PWR_SUPPLY_ERROR;
    }

    /* Calibrate the antenna (optional) */
    if (ST25R_SendDirectCommand(ST25R_CAL_ANTENNA_CMD) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    if (WaitForDirectCommand() != ST25R_OK) {
        return ST25R_IRQ_ERROR;
    }

    return ST25R_OK;

}

/**
 * @brief Initialize the reader operations
 * 
 * @return byte ST25R_OK if the reader operations have been initialized successfully
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_UNKNOWN_ERROR if an unknown error occurs
 */
byte ST25R_InitReaderOperations(void) {

    /* Local variables */
    byte regData = 0;

    /* Configure Mode Definition register (Type A selected by default) */
    ST25R_MODIFY_REG(regData, ST25R_ISO14443A_OPMODE << ST25R_OPMODE_POS, ST25R_OPMODE_MASK);
    if (ST25R_WriteRegister(ST25R_MODE_DEF_REG, regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Configure Bit Rate Definition register */
    regData = ST25R_TX_106KBPS | ST25R_RX_106KBPS;
    if (ST25R_WriteRegister(ST25R_BIT_RATE_REG, regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* (Optional) Configure other registers */

    /* Perform an analog preset command */
    if (ST25R_SendDirectCommand(ST25R_ANALOG_PRESET_CMD) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Enter in 'Ready mode' by setting 'en' bit in Operation Control register */
    if (ST25R_SetBitInRegister(ST25R_OP_CONTROL_REG, 7) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    if (WaitForSpecificIRQ(ST25R_OSC_FREQ_STABLE_IRQ) != ST25R_OK) {
        return ST25R_IRQ_ERROR;
    }

    /* Set Tx/Rx enable bits in Operation Control register */
    if (ST25R_SetBitInRegister(ST25R_OP_CONTROL_REG, 3) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    if (ST25R_SetBitInRegister(ST25R_OP_CONTROL_REG, 6) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* RFID protocols usually require that the reader field is turned on for a while before sending the first command (5 ms for ISO14443) */
    HAL_Delay(5);

    return ST25R_OK;

}


/**
 * @brief Set the bit rate of the ST25R3911B
 * 
 * @param bitRate Bit rate to be set
 * @return byte ST25R_OK if the bit rate has been set successfully
 * @return byte ST25R_WRONG_PARAMETER if the bit rate is not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 */
byte ST25R_SetBitRate(byte bitRate) {

    /* Local variables */
    byte regData = 0;

    /* Assert parameters */
    if (bitRate > ST25R_6780KBPS) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Modify the bit rate */
    switch (bitRate) {
        case ST25R_106KBPS:
            regData = ST25R_TX_106KBPS | ST25R_RX_106KBPS;
            break;
        case ST25R_212KBPS:
            regData = ST25R_TX_212KBPS | ST25R_RX_212KBPS;
            break;
        case ST25R_424KBPS:
            regData = ST25R_TX_424KBPS | ST25R_RX_424KBPS;
            break;
        case ST25R_848KBPS:
            regData = ST25R_TX_848KBPS | ST25R_RX_848KBPS;
            break;
        case ST25R_1695KBPS:
            regData = ST25R_TX_1695KBPS | ST25R_RX_1695KBPS;
            break;
        case ST25R_3390KBPS:
            regData = ST25R_TX_3390KBPS | ST25R_RX_3390KBPS;
            break;
        case ST25R_6780KBPS:
            regData = ST25R_TX_6780KBPS | ST25R_RX_3390KBPS;
            break;
        default:
            return ST25R_WRONG_PARAMETER;
    }

    /* Write the new bit rate */
    if (ST25R_WriteRegister(ST25R_BIT_RATE_REG, regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    return ST25R_OK;

}



/**
 * @brief Select the ISO14443 Type A protocol
 * 
 * @return byte ST25R_OK if the Type A protocol has been selected successfully
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_IRQ_ERROR if an error occurs during IRQ handling
 * @return byte ST25R_UNKNOWN_ERROR if an unknown error occurs
 */
byte ST25R_SelectTypeA(void) {

    /* Local variables */
    byte status = ST25R_OK;
    byte regData = 0;

    /* Configure Mode Definition register */
    status = ST25R_ModifyRegister(ST25R_MODE_DEF_REG, ST25R_ISO14443A_OPMODE << ST25R_OPMODE_POS, ST25R_OPMODE_MASK);
    if (status != ST25R_OK) {
        return status;
    }

    /* Configure ISO14443A bit rate register (106kbps by default) */
    regData = ST25R_TX_106KBPS | ST25R_RX_106KBPS;
    status = ST25R_WriteRegister(ST25R_BIT_RATE_REG, regData);
    if (status != ST25R_OK) {
        return status;
    }

    /* Set anticollision bit in proper register */
    status = ST25R_SetBitInRegister(ST25R_ISO14443A_NFC_REG, 0);
    if (status != ST25R_OK) {
        return status;
    }

    /* Configure Mask Receive Timer register to be compliant with ISO14443A Frame Delay Time (FDT) */
    regData = 16;  // MRT < FDT + 64/fc
    status = ST25R_WriteRegister(ST25R_MASK_RX_TIMER_REG, regData);
    if (status != ST25R_OK) {
        return status;
    }

    /* Configure No Response Timer register to be compliant with ISO14443A FDT */
    regData = 22; // NRT > FDT + 64/fc
    status = ST25R_WriteRegister(ST25R_NO_RESP_TIMER2_REG, regData);
    if (status != ST25R_OK) {
        return status;
    }

    /* (Optional) Configure other registers */

    /* Perform an analog preset command */
    status = ST25R_SendDirectCommand(ST25R_ANALOG_PRESET_CMD);
    if (status != ST25R_OK) {
        return status;
    }

    /* Enter in 'Ready mode' by setting 'en' bit in Operation Control register */
    status = ST25R_SetBitInRegister(ST25R_OP_CONTROL_REG, 7);
    if (status != ST25R_OK) {
        return status;
    }
    if (WaitForSpecificIRQ_T(ST25R_OSC_FREQ_STABLE_IRQ, 100) != ST25R_OK) {
        /* Check that bit osc_ok of Auxiliary Display register is set */
        ST25R_ReadRegister(ST25R_AUX_DISPLAY_REG, &regData);
        if (!LBIT4_MASK(regData)) {
            return ST25R_UNKNOWN_ERROR;
        }
    }
        

    /* Set Tx/Rx enable bits in Operation Control register */
    status = ST25R_SetBitInRegister(ST25R_OP_CONTROL_REG, 3);
    if (status != ST25R_OK) {
        return status;
    }
    status = ST25R_SetBitInRegister(ST25R_OP_CONTROL_REG, 6);
    if (status != ST25R_OK) {
        return status;
    }

