2sayle/NFC-with-STM32L476/Core/Src/st25r3911b_hal_driver.c
    /* RFID protocols usually require that the reader field is turned on 
    for a while before sending the first command (5 ms for ISO14443) */
    HAL_Delay(5);

    return ST25R_OK;

}


/**
 * @brief Select the ISO14443 Type B protocol
 * 
 * @return byte ST25R_OK if the Type B protocol has been selected successfully
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 */
byte ST25R_SelectTypeB(void) {
    
    /* Local variables */
    byte modIndex = ST25R_MOD_INDEX_9_9 & ST25R_MOD_INDEX_MASK;

    /* Set modulation index in AM modulation register */
    if (ST25R_WriteRegister(ST25R_AM_MOD_DEPTH_CONTROL_REG, modIndex) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Send 'Calibrate modulation depth' direct command */
    if (ST25R_SendDirectCommand(ST25R_CAL_MOD_DEPTH_CMD) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    if (WaitForDirectCommand() != ST25R_OK) {
        return ST25R_IRQ_ERROR;
    }

    // TODO: Implement the rest of the Type B protocol
    
    return ST25R_OK;

}


/* Measure functions */

/**
 * @brief Measure the power supply of various voltages on the ST25R3911B
 * 
 * @note This function works only if 'en' bit in Operation Control register is set
 * 
 * @param voltage Pointer to the voltage value
 * @param config Configuration of the power supply to be measured
 * 
 * @return byte ST25R_OK if the power supply has been measured successfully
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_UNKNOWN_ERROR if an unknown error occurs
 * @return byte ST25R_IRQ_ERROR if an error occurs during IRQ handling
 */

byte ST25R_MeasurePowerSupply(ushort *voltage, byte config) {

    /* Assert parameters */
    if (voltage == NULL) {
        return ST25R_WRONG_PARAMETER;
    }
    if (config > ST25R_MEAS_SRC_VSPRF) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Local variables */
    byte regData = 0;
    byte status = ST25R_OK;
    ushort lsb_uv = 23438; // 1 LSB = 23.438 mV = 23438 uV
    word microvolts = 0;

    /* Configure Regulator Voltage Control register */
    status = ST25R_ModifyRegister(ST25R_REGUL_VOLTAGE_CTRL_REG, config, ST25R_MEAS_SRC_MASK);
    if (status != ST25R_OK) {
        return status;
    }

    /* Send direct command for measuring the power */
    status = ST25R_SendDirectCommand(ST25R_MEAS_PWR_SUPPLY_CMD);
    if (status != ST25R_OK) {
        return status;
    }
    status = WaitForDirectCommand();
    if (status != ST25R_OK) {
        return status;
    }

    /* Read out ADC content */
    status = ST25R_ReadRegister(ST25R_AD_CONV_OUT_REG, &regData);
    if (status != ST25R_OK) {
        return status;
    }

    /* Compute the voltage (in mV) */
    microvolts = regData * lsb_uv;
    *voltage = (ushort) (microvolts / 1000);

    return ST25R_OK;
}


/* Generic Tx/Rx functions */

/**
 * @brief Transmit data to the PICC
 * 
 * @note This function is used to transmit bytes to the PICC 
 * regardless of the selected protocol.
 * 
 * @param pData Pointer to the data buffer
 * @param len Length of the data buffer
 * @param timeout Timeout for the transmission
 * 
 * @return byte ST25R_OK if the data has been transmitted successfully
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_UNKNOWN_ERROR if an unknown error occurs
 * @return byte ST25R_FIFO_OVFLOW_ERROR if an overflow occurs
 * @return byte ST25R_FIFO_UDFLOW_ERROR if an underflow occurs
 * @return byte ST25R_FIFO_EMPTY_ERROR if the FIFO is empty
 */
byte ST25R_TransmitData(byte *pData, ushort len, byte crcOption) {

    /* Assert parameters */
    if ((pData == NULL) || (len == 0)) {
        return ST25R_WRONG_PARAMETER;
    }
    if (len > MAX_NUMBER_TX_BYTES) {
        return ST25R_WRONG_PARAMETER;
    }
    if (crcOption > TX_CRC_OFF) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Local variables */
    byte status = ST25R_OK;
    //byte regData = 0;
    byte lenArray[2] = {0};

    /* Send 'Clear' direct command to clear the FIFO */
    status = ST25R_SendDirectCommand(ST25R_CLEAR_CMD);
    if (status != ST25R_OK) {
        return status;
    }

    /* Configure the Number of Transmitted Bytes registers 1 and 2 */
    len <<= 3;
    lenArray[0] = (byte) ((len & 0xFF00) >> 8); // MSB
    lenArray[1] = (byte) (len & 0x00FF);        // LSB 
    status = ST25R_WriteMultipleRegisters(ST25R_NB1_TX_BYTES_REG, lenArray, 2);
    if (status != ST25R_OK) {
        return status;
    }


    /* Case 1. Data length is inferior to FIFO length */
    if (len <= FIFO_SIZE) {

        /* Fill the FIFO */
        status = ST25R_LoadFifo(pData, (byte)len);
        if (status != ST25R_OK) {
            return status;
        }

        /* Send the data */
        if (crcOption == TX_CRC_ON) {
            status = ST25R_SendDirectCommand(ST25R_TRANSMIT_WITH_CRC_CMD);
        } else {
            status = ST25R_SendDirectCommand(ST25R_TRANSMIT_WITHOUT_CRC_CMD);
        }
        if (status != ST25R_OK) {
            return status;
        }

        /* Wait for the end of transmission */
        if (WaitForSpecificIRQ(ST25R_TX_STOP_IRQ) != ST25R_OK) {
            return ST25R_IRQ_ERROR;
        }

    }

    /* Case 2. Data length is superior to FIFO length */
    else {

        /* Compute the number of iterations */
        byte nbFifoLoads = len / FIFO_SIZE;
        byte nbLeftBytes = len % FIFO_SIZE;

        for (byte i = 0; i < nbFifoLoads; i++) {

            /* Fill the FIFO */
            status = ST25R_LoadFifo(pData, FIFO_SIZE);
            if (status != ST25R_OK) {
                return status;
            }

            /* Send the data */
            if (crcOption == TX_CRC_ON) {
                status = ST25R_SendDirectCommand(ST25R_TRANSMIT_WITH_CRC_CMD);
            } else {
                status = ST25R_SendDirectCommand(ST25R_TRANSMIT_WITHOUT_CRC_CMD);
            }
            if (status != ST25R_OK) {
                return status;
            }

            /* Wait for the water level IRQ */
            if (WaitForSpecificIRQ(ST25R_FIFO_WATER_LVL_IRQ) != ST25R_OK) {
                return ST25R_IRQ_ERROR;
            }

            /* Update the data pointer */
            pData += FIFO_SIZE;

